{"100":{"level":"Informational","description":"Continuar - SERVIÇO EXPERIMENTAL","means":"Isso significa que o servidor recebeu os cabeçalhos da solicitação, e que o cliente deve proceder para enviar o corpo do pedido (no caso de haver um pedido um corpo deve ser enviado, por exemplo, um POST pedido). Se o corpo é grande o pedido, enviando-os para um servidor, quando o pedido já foi rejeitada com base em cabeçalhos inadequado é ineficiente. Para ter um cheque do servidor se o pedido pode ser aceite com base no pedido de cabeçalhos sozinho, o cliente deve enviar Esperar: 100-continue como um cabeçalho no seu pedido inicial e verifique se a 100 Continuar código de status é recebido em resposta antes de permanente (ou receber 417 Falha na expectativa e não continuar)"},"101":{"level":"Informational","description":"Mudando protocolos - SERVIÇO EXPERIMENTAL","means":"Isso significa que o solicitante pediu ao servidor para mudar os protocolos e o servidor está reconhecendo que irá fazê-lo. 102 Processamento (WebDAV) (RFC 2518) Como uma solicitação WebDAV pode conter muitos sub-pedidos que envolvam operações de arquivo, pode demorar muito tempo para concluir o pedido. Este código indica que o servidor recebeu e está processando o pedido, mas nenhuma resposta ainda não está disponível. Isso impede que o cliente o tempo limite e supondo que o pedido foi perdido."},"122":{"level":"Informational","description":"Pedido-URI muito longo - SERVIÇO EXPERIMENTAL","means":"Este é um padrão IE7 somente código não significa que o URI é mais do que um máximo de 2083 caracteres. (Ver código 414)"},"200":{"level":"Received","description":"Sucesso","means":"Padrão de resposta para solicitações HTTP sucesso. A resposta real dependerá do método de solicitação usado. Em uma solicitação GET, a resposta conterá uma entidade que corresponde ao recurso solicitado. Em uma solicitação POST a resposta conterá a descrição de uma entidade, ou contendo o resultado da ação."},"201":{"level":"Received","description":"Criado","means":"O pedido foi cumprido e resultou em um novo recurso que está sendo criado."},"202":{"level":"Received","description":"Aceito","means":"O pedido foi aceito para processamento, mas o tratamento não foi concluído. O pedido poderá ou não vir a ser posta em prática, pois pode ser anulado quando o processamento ocorre realmente."},"203":{"level":"Received","description":"Não Autorizado","means":"O servidor processou a solicitação com sucesso, mas está retornando informações que podem ser de outra fonte."},"204":{"level":"Received","description":"Nenhum conteúdo","means":"O servidor processou a solicitação com sucesso, mas não é necessário nenhuma resposta."},"205":{"level":"Received","description":"Reset","means":"O servidor processou a solicitação com sucesso, mas não está retornando nenhum conteúdo. Ao contrário da 204, esta resposta exige que o solicitante redefinir a exibição de documento."},"206":{"level":"Received","description":"Conteúdo parcial","means":"O servidor está entregando apenas parte do recurso devido a um cabeçalho intervalo enviados pelo cliente. O cabeçalho do intervalo é usado por ferramentas como wget para permitir retomada de downloads interrompidos, ou dividir um download em vários fluxos simultâneos."},"207":{"level":"Received","description":"Status Multi (WebDAV) (RFC 4918)","means":"O corpo da mensagem que se segue é um XML da mensagem e pode conter um número de códigos de resposta individual, dependendo de quantas sub-pedidos foram feitos."},"300":{"level":"Redirect","description":"Múltipla escolha","means":"Indica várias opções para o recurso que o cliente pode acompanhar. É, por exemplo, poderia ser usado para apresentar opções de formato diferente para o vídeo, arquivos de lista com diferentes extensões, ou desambiguação sentido da palavra."},"301":{"level":"Redirect","description":"Movido","means":"Esta e todas as solicitações futuras devem ser direcionada para o URI"},"302":{"level":"Redirect","description":"Encontrado","means":"Este é um exemplo de boas práticas industriais contradizendo a norma. especificação HTTP\/1.0 (RFC 1945) exigiu o cliente para executar um redirecionamento temporário (o que descreve frase original era \"Movido Temporariamente\"), mas os browsers populares executadas 302 com a funcionalidade de um 303 Consulte Outros. Por isso, acrescentou HTTP\/1.1 códigos de status 303 e 307 a distinguir entre os dois comportamentos. No entanto, a maioria das aplicações Web e os quadros ainda usam o código de status 302 como se fosse o 303"},"304":{"level":"Redirect","description":"Não modificado","means":"Indica que o recurso não foi modificado desde o último pedido. Normalmente, o cliente fornece um cabeçalho HTTP como o Se-Modificado-Desde cabeçalho para proporcionar um tempo contra o qual para comparar. Usando este poupa largura de banda e de reprocessamento no servidor e cliente, uma vez que apenas os dados do cabeçalho devem ser enviados e recebidos em comparação com a totalidade da página que está sendo reprocessados ​​pelo servidor, em seguida, enviado novamente utilizando mais largura de banda do servidor e cliente"},"305":{"level":"Redirect","description":"Use Proxy","means":"Muitos clientes HTTP (como o Mozilla e Internet Explorer) podem não tratar corretamente as respostas com este código de status, principalmente por razões de segurança"},"306":{"level":"Redirect","description":"Proxy Switch","means":"Mudança de proxy. Deixou de ser usado"},"307":{"level":"Redirect","description":"Redirecionamento temporário","means":"Nesta ocasião, o pedido deve ser repetido com outro URI, mas futuras solicitações ainda pode usar a URI original. Em contraste com a 303, o método de pedido não deve ser mudado quando a reedição do pedido original. Por exemplo, uma solicitação POST deve ser repetido com outro pedido POST"},"400":{"level":"Client ERROR","description":"Requisição inválida","means":"O pedido não pode ser entregue devido à sintaxe incorreta."},"401":{"level":"Client ERROR","description":"Não autorizado","means":"Semelhante ao 403 Forbidden, mas especificamente para o uso quando a autenticação é possível, mas não conseguiu ou ainda não foram fornecidos. A resposta deve incluir um cabeçalho do campo www-authenticat contendo um desafio aplicável ao recurso solicitado. Veja Basic autenticação de acesso e autenticação Digest acesso"},"402":{"level":"Client ERROR","description":"Pagamento necessário","means":"Reservado para uso futuro. A intenção original era que esse código pudesse ser usado como parte de alguma forma de dinheiro digital ou de micro pagamento regime, mas isso não aconteceu, e esse código não é usado normalmente."},"403":{"level":"Client ERROR","description":"Proibido","means":"O pedido foi um pedido legal, mas o servidor está recusando a responder a ela. Ao contrário de um Unauthorized 401 resposta, autenticação não fará diferença"},"404":{"level":"Client ERROR","description":"Não encontrado","means":"O recurso requisitado não foi encontrado, mas pode ser disponibilizado novamente no futuro. As solicitações subsequentes pelo cliente são permitidas"},"405":{"level":"Client ERROR","description":"Método não permitido","means":"Foi feita uma solicitação de um recurso usando um método de pedido não é compatível com esse recurso, por exemplo, usando GET em um formulário, que exige que os dados a serem apresentados via POST, PUT ou usar em um recurso somente de leitura"},"406":{"level":"Client ERROR","description":"Não Aceitável","means":"O recurso solicitado é apenas capaz de gerar conteúdo não aceitáveis ​​de acordo com os cabeçalhos Accept enviados na solicitação"},"407":{"level":"Client ERROR","description":"Autenticação de proxy necessária","means":"Não passou pela autenticação do proxy"},"408":{"level":"Client ERROR","description":"Tempo de requisição esgotou","means":"O servidor sofreu timeout ao aguardar a solicitação. De acordo com as especificações HTTP W3: \"O cliente não apresentou um pedido dentro do tempo que o servidor estava preparado para esperar. O cliente PODE repetir o pedido sem modificações a qualquer momento mais tarde"},"409":{"level":"Client ERROR","description":"Conflito","means":"Indica que a solicitação não pôde ser processada por causa do conflito no pedido, como um conflito de edição"},"410":{"level":"Client ERROR","description":"Indisponível","means":"Indica que o recurso solicitado não está mais disponível e não estará disponível novamente. Isto deve ser usado quando um recurso foi intencionalmente removido e os recursos devem ser removidos. Ao receber um código de estado 410, o cliente não deverá solicitar o recurso novamente no futuro. Clientes como motores de busca devem remover o recurso de seus índices. A maioria dos casos de uso não necessitam de clientes e motores de busca para purgar o recurso, e um \"404 Not Found\" pode ser utilizado"},"411":{"level":"Client ERROR","description":"Comprimento necessário","means":"O pedido não especifica o comprimento do seu conteúdo, o que é exigido pelo recurso solicitado"},"412":{"level":"Client ERROR","description":"Pré-condição falhou","means":"O servidor não cumpre uma das condições que o solicitante coloca na solicitação"},"413":{"level":"Client ERROR","description":"Entidade de solicitação muito grande","means":"A solicitação é maior do que o servidor está disposto ou capaz de processar"},"414":{"level":"Client ERROR","description":"URI muito longo","means":"O URI fornecido foi muito longo para ser processado pelo servidor"},"415":{"level":"Client ERROR","description":"Tipo de mídia não suportado","means":"A entidade tem um pedido tipo de mídia que o servidor ou o recurso não tem suporte. Por exemplo, o cliente carrega uma imagem como image \/ svg + xml, mas o servidor requer que imagens usar um formato diferente"},"416":{"level":"Client ERROR","description":"Solicitada de Faixa Não Satisfatória","means":"O cliente solicitou uma parte do arquivo, mas o servidor não pode fornecer essa parte. Por exemplo, se o cliente pediu uma parte do arquivo que está para além do final do arquivo"},"417":{"level":"Client ERROR","description":"Falha na expectativa","means":"O servidor não pode cumprir as exigências do campo de cabeçalho Espere-pedido"},"418":{"level":"Client ERROR","description":"Eu sou um bule de chá","means":"Este código foi definido em 1998 como uma das tradicionais brincadeiras de 1º de abril da IETF, na RFC 2324, Hyper Text Cafeteira Control Protocol, e não é esperado para ser implementado por servidores HTTP reais"},"422":{"level":"Client ERROR","description":"Entidade improcessável (WebDAV)","means":"O pedido foi bem formado, mas era incapaz de ser seguido devido a erros de semântica"},"423":{"level":"Client ERROR","description":"Fechado (WebDAV)","means":"O recurso que está sendo acessado está bloqueado"},"424":{"level":"Client ERROR","description":"Falha de Dependência (WebDAV)","means":"A solicitação falhou devido à falha de uma solicitação anterior (por exemplo, um PROPPATCH)"},"425":{"level":"Client ERROR","description":"Coleção não ordenada","means":"Definido em projectos de \"WebDAV Avançada Coleções Protocolo\", mas não está presente no Web Distributed Authoring and Versioning (WebDAV) Ordenados Coleções protocolo"},"426":{"level":"Client ERROR","description":"Upgrade Obrigatório","means":"O cliente deve mudar para um outro protocolo, como TLS\/1.0 . Resposta n º 444 Um Nginx extensão do servidor HTTP. O servidor retorna nenhuma informação para o cliente e fecha a conexão (útil como um impedimento para malware). Com 449 Repetir Uma extensão de Microsoft. O pedido deve ser repetida após a realização da ação apropriada"},"450":{"level":"Client ERROR","description":"Bloqueados pelo Controle de Pais do Windows","means":"Uma extensão de Microsoft. Este erro é dado quando Parental Controls do Windows estão ativadas e está bloqueando o acesso a determinada página da web"},"499":{"level":"Client ERROR","description":"Cliente fechou Pedido (utilizado em ERPs\/VPSA)","means":"Um Nginx extensão do servidor HTTP. Este código é introduzido para registrar o caso quando a conexão é fechada pelo cliente ao servidor HTTP é o processamento de seu pedido, fazendo com que servidor não consiga enviar o cabeçalho HTTP de volta"},"500":{"level":"Server ERROR","description":"Erro interno do SERVIDOR","means":"Indica um erro do servidor ao processar a solicitação. Na grande maioria dos casos está relacionada as permissões dos arquivos ou pastas do software ou script que o usuário tenta acessar e não foram configuradas no momento da programação\/construção do site ou da aplicação."},"501":{"level":"Server ERROR","description":"Não implementado","means":"O servidor ainda não suporta a funcionalidade ativada"},"502":{"level":"Server ERROR","description":"Bad Gateway","means":"Em regra, o erro quando há uma configuração imprecisa entre os computadores de back-end, possivelmente incluindo o servidor Web no site visitado. Antes de analisar este problema, é necessário limpar o cache do navegador, completamente. Se estiver navegando na Web e observar este problema em todos os websites visitados, então 1) o seu provedor de serviço de Internet tem uma falha\/sobrecarga em um equipamento principal ou 2) tem algo de errado com a sua conexão interna à Internet, por exemplo, o firewall não está funcionando corretamente. Se for o primeiro caso, somente o seu provedor pode ajudar. Se for o segundo, você precisa corrigir o que quer que esteja prevenindo que você acesse a Internet. Se tiver este problema somente em alguns websites visitados, provavelmente existe um problema nos sites. Por exemplo, uma das peças dos equipamentos estão falhando ou estão sobrecarregadas. Entre em contato com os responsáveis destes sites"},"503":{"level":"Server ERROR","description":"Serviço indisponível","means":"O servidor está em manutenção ou não consegue dar conta dos processamentos de recursos devido à sobrecarga do sistema. Isto deve ser uma condição temporária"},"504":{"level":"Server ERROR","description":"Gateway Timeout","means":"É caracterizado por erros particulares do site em questão. Pode ser que o site esteja em manutenção ou não exista"},"505":{"level":"Server ERROR","description":"Versão de HTTP Não suportada","means":"A maioria dos browsers assumem que os servidores de rede suportam versões 1.x do protocolo HTTP. Na prática, as versões muito antigas como a 0.9 são pouco utilizadas atualmente, não apenas porque eles fornecem pouca segurança e desempenho mais baixo do que as versões mais recentes do protocolo. Então, se acontecer esse erro no seu navegador de rede, a única opção é fazer o upgrade do software do servidor de rede. Se a versão da solicitação 1.x falhar, pode ser porque o servidor de rede está suportando versões incorretas do protocolo 1.x, em vez de não suportá-las"}}